import numpy as np  # 数组相关的库
import matplotlib.pyplot as plt  # 绘图库
from matplotlib.ticker import MultipleLocator

count = 0
with open('log/resnet_scaffold_yes.log', 'r') as inF:
    for line in inF:
        if 'Global Model Test accuracy' in line:
            print(line[-10:-1], ",")
            count += 1
    # do_something

print("count = ", count)

y = np.array([
 0.100000 ,
 0.100000 ,
 0.100000 ,
 0.100000 ,
 0.100000 ,
 0.100000 ,
 0.100000 ,
 0.100000 ,
 0.100000 ,
 0.100000 ,
 0.100000 ,
 0.583900 ,
 0.583200 ,
 0.606700 ,
 0.686700 ,
 0.685700 ,
 0.677800 ,
 0.679300 ,
 0.723100 ,
 0.717000 ,
 0.739100 ,
 0.733200 ,
 0.759000 ,
 0.717500 ,
 0.776300 ,
 0.770600 ,
 0.788800 ,
 0.775800 ,
 0.781200 ,
 0.786100 ,
 0.788700 ,
 0.733600 ,
 0.805400 ,
 0.809700 ,
 0.821800 ,
 0.801000 ,
 0.772200 ,
 0.807300 ,
 0.783600 ,
 0.804500 ,
 0.719100 ,
 0.796100 ,
 0.807500 ,
 0.734200 ,
 0.680600 ,
 0.780400 ,
 0.786400 ,
 0.750900 ,
 0.765100 ,
 0.794800 ,
 0.799200 ,
 0.753400 ,
 0.751100 ,
 0.780400 ,
 0.817500 ,
 0.816200 ,
 0.782200 ,
 0.760400 ,
 0.806300 ,
 0.803000 ,
 0.740200 ,
 0.716600 ,
 0.756600 ,
 0.804800 ,
 0.821700 ,
 0.795000 ,
 0.730600 ,
 0.788500 ,
 0.736700 ,
 0.742500 ,
 0.726500 ,
 0.705200 ,
 0.724400 ,
 0.798200 ,
 0.793300 ,
 0.715500 ,
 0.723900 ,
 0.748200 ,
 0.669700 ,
 0.752900 ,
 0.815100 ,
 0.821600 ,
 0.760000 ,
 0.720900 ,
 0.714200 ,
 0.715300 ,
 0.794800 ,
 0.753000 ,
 0.740200 ,
 0.809300 ,
 0.683500 ,
 0.737100 ,
 0.785400 ,
 0.770900 ,
 0.749800 ,
 0.768800 ,
 0.789800 ,
 0.756500 ,
 0.744200 ,
 0.768800 ,
])

# y = np.array([
#  0.377000 ,
#  # 0.389200 ,
#  0.745300 ,
#  # 0.603000 ,
#  0.787000 ,
#  # 0.621800 ,
#  0.755400 ,
#  # 0.605600 ,
#  0.795800 ,
#  # 0.610100 ,
#  0.808500 ,
#  # 0.659800 ,
#  0.803600 ,
#  # 0.673000 ,
#  0.756700 ,
#  # 0.747900 ,
#  0.718600 ,
#  # 0.764400 ,
#  0.632100 ,
#  # 0.753300 ,
#  0.663000 ,
#  # 0.768000 ,
# ])



plt.figure(figsize=(10,7))
font1 = {
    'weight' : 'normal',
    'size'   : 16,
}
font2 = {
    'weight' : 'normal',
    'size'   : 16,
}
plt.legend(prop=font2)

plt.axhline(0.78)

plt.plot(np.arange(0,len(y),1)*2, y,'-',linestyle='-', color='b', label='VGG-11(Fednova_Dynamic)')
# print(len(y_org))

plt.xlabel('Rounds',fontdict=font1)
plt.ylabel('Accuracy',font1)
plt.legend(prop=font1)

plt.tight_layout()

plt.yticks(fontproperties = 'noraml', size = 15)
tlist=plt.xticks(fontproperties = 'normal', size = 15)

plt.savefig('resnet_scaffold_yes.pdf')
plt.show()
print(len(y))